print("Приветик!")
name = input("Как твоё имя? ")
print(name + ", очень приятно! А меня Пинки зовут")

# Просто вопросы и ответы, без проверок на "стоп"
answer1 = input("Ты любишь собак? ")
print("Ясно...")

answer2 = input("А ты какое мороженое любишь? ")  
print("Круто!")

answer3 = input("А ты о чём мечтаешь? ")
print("Очень славно. А я мечтаю о бесконечном мороженом")

answer4 = input("А сколько тебе лет? ")
print("Понятно, " + name + ", и " + answer4 + " лет...")

answer5 = input("Ладно пока! засиделась я тут! но не скучай, мы ещё пообщаемся!")
print("пока-пока...")
